Why you should use Pandas even if you don't work on ML

### Optional Create and reading CSV

In [1]:
data_as_dict = {
    'emp_code':100001,
    'Name':'Upendra'
}

In [2]:
import pandas as pd

In [3]:
pd.json_normalize(data_as_dict)

   emp_code     Name
0     70001  Upendra

In [28]:
data_as_list_of_dic = [{
    'emp_code':100001,
    'Name':'Upendra'
},{
    'emp_code':10003,
    'Name':'Singhai'
}]

In [29]:
pd.DataFrame(data_as_list_of_dic)

   emp_code     Name
0    100001  Upendra
1     10003  Singhai

In [6]:
print(df.to_csv())

,emp_code,Name
0,70001,Upendra
1,70003,Singhai

In [7]:
print(df.to_csv(index = False))

emp_code,Name
70001,Upendra
70003,Singhai

## Create Dummy Data

In [8]:
import pandas as pd
import random
from datetime import date, timedelta

# Generate dummy data
first_names = ['John', 'Jane', 'Bob', 'Alice', 'Mike', 'Mary', 'David', 'Sarah', 'Tom', 'Emily']
last_names = ['Smith', 'Doe', 'Johnson', 'Brown', 'White', 'Davis', 'Martin', 'Thompson', 'Taylor', 'Anderson']

def random_phone_number():
    phone =  f"tel: ({random.randint(100, 999)}) {random.randint(100, 999)}-{random.randint(1000, 9999)}"
    if random.random() < 0.05:
        phone = None
    return phone

def random_zip_code():
    return random.randint(10000, 99999)

def random_name():
    name = f"{random.choice(first_names)} {random.choice(last_names)}"
    if random.random() < 0.05:
        spaces = random.randint(1, 5)
        name = ' ' * spaces + name + ' ' * spaces
    return name

def random_date():
    start_date = date(2020, 1, 1)
    end_date = date(2022, 12, 31)
    delta = end_date - start_date
    random_days = random.randint(0, delta.days)
    random_date = start_date + timedelta(days=random_days)
    separators = ['|']
    return f"{random_date.day}{random.choice(separators)}{random_date.month}{random.choice(separators)}{random_date.year}"

# Generate a list of 10 random Zip codes
zip_codes = [random_zip_code() for _ in range(10)]

# Create a DataFrame
data = {'Name': [random_name() for i in range(2000000)],
        'Phone Number': [random_phone_number() for i in range(2000000)],
        'Zip Code': [random.choice(zip_codes) for i in range(2000000)],
        'Last Updated': [random_date() for i in range(2000000)]}
df = pd.DataFrame(data)

# Save DataFrame as CSV
df.to_csv('phone_directory.csv', index=False)

# Print the first few rows of the DataFrame
print(df.head())

           Name         Phone Number  Zip Code Last Updated
0    Mary Smith  tel: (499) 891-5523     28418   26|10|2022
1     Emily Doe  tel: (414) 635-1299     50847   17|10|2022
2    Mary Brown  tel: (744) 903-5904     29494    10|9|2020
3   John Taylor  tel: (747) 399-4829     45646    20|3|2021
4  Emily Taylor  tel: (382) 889-9521     45646    26|3|2021

In [9]:
df = pd.read_csv('phone_directory.csv')
df.head()

           Name         Phone Number  Zip Code Last Updated
0    Mary Smith  tel: (499) 891-5523     28418   26|10|2022
1     Emily Doe  tel: (414) 635-1299     50847   17|10|2022
2    Mary Brown  tel: (744) 903-5904     29494    10|9|2020
3   John Taylor  tel: (747) 399-4829     45646    20|3|2021
4  Emily Taylor  tel: (382) 889-9521     45646    26|3|2021

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000000 entries, 0 to 1999999
Data columns (total 4 columns):
 #   Column        Dtype
---  ------        -----
 0   Name          object
 1   Phone Number  object
 2   Zip Code      int64
 3   Last Updated  object
dtypes: int64(1), object(3)
memory usage: 61.0+ MB

# 1. Sort data

In [11]:
df.head()

           Name         Phone Number  Zip Code Last Updated
0    Mary Smith  tel: (499) 891-5523     28418   26|10|2022
1     Emily Doe  tel: (414) 635-1299     50847   17|10|2022
2    Mary Brown  tel: (744) 903-5904     29494    10|9|2020
3   John Taylor  tel: (747) 399-4829     45646    20|3|2021
4  Emily Taylor  tel: (382) 889-9521     45646    26|3|2021

In [12]:
df.shape

(2000000, 4)

In [13]:
df.sort_values('Zip Code', ascending=True, inplace=True)

In [14]:
 pd.pivot_table(df, values='Phone Number', index='Zip Code', aggfunc='count')

          Phone Number
Zip Code
14422           189940
16194           190181
23595           189860
28418           189602
29494           189709
39471           189929
45646           190288
50847           190606
67761           190045
98776           190288

# 2. Remove White Space

In [15]:
#clear whitespace
df['Name']=df['Name'].str.strip()

# 3. Drop rows with missing data

In [16]:
# find
df[df['Phone Number'].isna()]

                   Name Phone Number  Zip Code Last Updated
250611     Mary Johnson          NaN     14422   24|12|2020
250676     Jane Johnson          NaN     14422    10|1|2021
250538     Emily Taylor          NaN     14422    18|4|2022
1561255     Emily White          NaN     14422     2|8|2021
965731       Tom Taylor          NaN     14422     4|3|2020
...                 ...          ...       ...          ...
313069      David Brown          NaN     98776     9|6|2022
313163     Sarah Taylor          NaN     98776    20|8|2021
675799   Alice Anderson          NaN     98776    25|6|2021
985541     Sarah Taylor          NaN     98776    26|2|2022
610454       Mike Davis          NaN     98776     6|3|2021

[99552 rows x 4 columns]

In [17]:
# Find empty strings
df[df['Name'].str.strip() == '']
# drop - reversed the condition 
# df = df[df['Name'].str.strip() != '']

Empty DataFrame
Columns: [Name, Phone Number, Zip Code, Last Updated]
Index: []

In [18]:
# drop
df.dropna(subset=['Phone Number'], inplace=True)

In [19]:
df

                   Name         Phone Number  Zip Code Last Updated
1999999    Sarah Martin  tel: (427) 726-4006     14422    19|7|2021
590819       Jane White  tel: (968) 579-1733     14422    25|1|2022
250605        Tom White  tel: (685) 543-6596     14422    18|6|2020
965547      Sarah Davis  tel: (314) 769-6408     14422    25|3|2020
1561217      John Davis  tel: (329) 655-1008     14422   19|10|2022
...                 ...                  ...       ...          ...
985551   David Thompson  tel: (759) 922-1735     98776   23|11|2022
313134   Emily Thompson  tel: (261) 314-1860     98776    26|5|2022
985553          Tom Doe  tel: (396) 561-3616     98776    22|6|2022
1809088   Emily Johnson  tel: (700) 784-6363     98776    14|5|2022
109128     Bob Anderson  tel: (191) 496-4240     98776    7|12|2020

[1900448 rows x 4 columns]

# 3 Bonus. Drop unwanted charaters ($ , tel)

In [20]:
# df['Column A'].str.replace('$', '')
df['Phone Number'] = df['Phone Number'].str.replace('tel: ', '')

# 4. Splitting a column into multiple columns

In [21]:
df['Phone Number'].str.extract(r'\((\d{3})\) (\d{3}-\d{4})')

           0         1
1999999  427  726-4006
590819   968  579-1733
250605   685  543-6596
965547   314  769-6408
1561217  329  655-1008
...      ...       ...
985551   759  922-1735
313134   261  314-1860
985553   396  561-3616
1809088  700  784-6363
109128   191  496-4240

[1900448 rows x 2 columns]

In [22]:
# Split phone numbers into area code and phone numbers
df[['Area Code', 'Phone Number']] = df['Phone Number'].str.extract(r'\((\d{3})\) (\d{3}-\d{4})')

In [23]:
df.head()

                 Name Phone Number  Zip Code Last Updated Area Code
1999999  Sarah Martin     726-4006     14422    19|7|2021       427
590819     Jane White     579-1733     14422    25|1|2022       968
250605      Tom White     543-6596     14422    18|6|2020       685
965547    Sarah Davis     769-6408     14422    25|3|2020       314
1561217    John Davis     655-1008     14422   19|10|2022       329

# 5. Convert Strage Dates to proper datatime

In [24]:
df['Last Updated']

1999999     19|7|2021
590819      25|1|2022
250605      18|6|2020
965547      25|3|2020
1561217    19|10|2022
              ...
985551     23|11|2022
313134      26|5|2022
985553      22|6|2022
1809088     14|5|2022
109128      7|12|2020
Name: Last Updated, Length: 1900448, dtype: object

In [25]:
df['Last Updated'] = pd.to_datetime(df['Last Updated'], format='%d|%m|%Y')

In [26]:
df

                   Name Phone Number  Zip Code Last Updated Area Code
1999999    Sarah Martin     726-4006     14422   2021-07-19       427
590819       Jane White     579-1733     14422   2022-01-25       968
250605        Tom White     543-6596     14422   2020-06-18       685
965547      Sarah Davis     769-6408     14422   2020-03-25       314
1561217      John Davis     655-1008     14422   2022-10-19       329
...                 ...          ...       ...          ...       ...
985551   David Thompson     922-1735     98776   2022-11-23       759
313134   Emily Thompson     314-1860     98776   2022-05-26       261
985553          Tom Doe     561-3616     98776   2022-06-22       396
1809088   Emily Johnson     784-6363     98776   2022-05-14       700
109128     Bob Anderson     496-4240     98776   2020-12-07       191

[1900448 rows x 5 columns]